testquery.xml

POST /webserviceexternal/contracts.asmx HTTP/1.1
Content-Type: text/xml; charset=utf-8
Content-Length: 1280
SOAPAction: http://www.JOI.com/schemas/ViaSub.WMS/CreateOrders
Host: secure-wms.com
Connection: keep-alive

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <extLoginData xmlns="http://www.JOI.com/schemas/ViaSub.WMS/">
      <ThreePLKey>{a240f2fb-ff00-4a62-b87b-aecf9d5123f9}</ThreePLKey>
      <Login>kristest</Login>
      <Password>kristest</Password>
      <FacilityID>2</FacilityID>
    </extLoginData>
    <orders xmlns="http://www.JOI.com/schemas/ViaSub.WMS/">
      <Order>
        <TransInfo>
          <ReferenceNum>35267eef-c207-4a4b-8e63-50383d0ffd15</ReferenceNum>
        </TransInfo>
        <ShipTo>
          <Name>Rama Damunaste</Name>
          <CompanyName>Rama Damunaste</CompanyName>
          <Address>
            <Address1>10 Downing St.</Address1>
            <City>London</City>
            <State>OR</State>
            <Zip>97213</Zip>
            <Country>US</Country>
          </Address>
          <PhoneNumber1>1234567890</PhoneNumber1>
          <EmailAddress1>rama@damunaste.org</EmailAddress1>
        </ShipTo>
        <ShippingInstructions>
          <Carrier>USPS</Carrier>
          <Mode>FirstClassMail</Mode>
          <BillingCode>Prepaid</BillingCode>
        </ShippingInstructions>
        <Notes>none</Notes>
        <OrderLineItems>
          <OrderLineItem>
            <SKU>SKU 10</SKU>
            <Qty>1</Qty>
          </OrderLineItem>
          <OrderLineItem>
            <SKU>SKU 100</SKU>
            <Qty>1</Qty>
          </OrderLineItem>
        </OrderLineItems>
      </Order>
    </orders>
    <warnings xmlns="http://www.JOI.com/schemas/ViaSub.WMS/">none</warnings>
  </soap:Body>
</soap:Envelope>
